{
  "1": "S'ha produït un error del sistema",
  "2": "S'ha produït un error del sistema",
  "3": "El correu electrònic és obligatori",
  "4": "El correu electrònic ha de tenir com a màxim {0} caràcters",
  "5": "El correu electrònic s'ha enviat en un format incorrecte",
  "6": "L'objecte de la sol·licitud és obligatori",
  "7": "El format de la data és incorrecte per a {0}",
  "8": "El número d'identitat és obligatori",
  "9": "El número d'identitat ha de tenir com a màxim {0} caràcters",
  "10": "El número d'identitat ha de tenir com a mínim {0} caràcters",
  "11": "Sol·licitud no vàlida",
  "12": "Número de targeta no vàlid",
  "13": "Mes de caducitat no vàlid",
  "14": "Any de caducitat no vàlid",
  "15": "CVC no vàlid",
  "16": "El nom del titular de la targeta és obligatori",
  "17": "La data de caducitat de la targeta no és vàlida",
  "18": "El número d'identitat {0} s'ha enviat en un format incorrecte",
  "19": "El nom del titular de la targeta ha de tenir com a màxim {0} caràcters",
  "20": "El camp ConversationId ha de tenir com a màxim {0} caràcters",
  "21": "L'àlies de la targeta ha de tenir com a màxim {0} caràcters",
  "22": "La IP ha de tenir com a màxim {0} caràcters",
  "23": "L'URL de resposta és obligatori",
  "24": "{0} és obligatori",
  "25": "El número de GSM és obligatori",
  "26": "El número de GSM ha de tenir com a màxim {0} caràcters",
  "27": "Número de telèfon no vàlid",
  "28": "Format de metadades no vàlid",
  "29": "El token de reclamació és obligatori",
  "30": "L'identificador de membre és obligatori",
  "31": "ConversationId pot contenir codi maliciós",
  "1000": "Signatura no vàlida",
  "1001": "No s'han trobat els detalls de l'API",
  "1002": "Comerciant no trobat",
  "1003": "Error d'autorització",
  "1004": "La cadena aleatòria és obligatòria",
  "1005": "L'objecte de la sol·licitud és obligatori",
  "1006": "La clau API és obligatòria",
  "1007": "La signatura és obligatòria",
  "1008": "No s'ha trobat el prefix de l'encapçalament d'autorització",
  "1009": "La cadena de l'encapçalament d'autorització és obligatòria",
  "1010": "Comerciant del passarel·la no trobat",
  "1011": "El comerciant autoritzat i el número de comerciant no coincideixen",
  "1012": "Plataforma activa no trobada",
  "1013": "Usuari associat al nom de l'aplicació no trobat",
  "1014": "Informació de seguretat no trobada",
  "1015": "El nom de l'aplicació és obligatori",
  "2000": "Aquest servei només està disponible per a clients del marketplace",
  "2001": "Subcomerciant no trobat",
  "2002": "El subcomerciant ja existeix",
  "2003": "subMerchantKey és obligatori",
  "2004": "subMerchantType és obligatori",
  "2005": "IBAN és obligatori",
  "2007": "subMerchantExternalId és obligatori",
  "2008": "subMerchantExternalId ha de tenir com a màxim {0} caràcters",
  "2009": "L'adreça és obligatòria",
  "2010": "L'adreça ha de tenir com a màxim {0} caràcters",
  "2011": "L'adreça ha de tenir com a mínim {0} caràcters",
  "2012": "El nom del contacte és obligatori",
  "2013": "El nom del contacte ha de tenir com a màxim {0} caràcters",
  "2014": "El nom del contacte ha de tenir com a mínim {0} caràcters",
  "2015": "El cognom del contacte és obligatori",
  "2016": "El cognom del contacte ha de tenir com a màxim {0} caràcters",
  "2017": "El cognom del contacte ha de tenir com a mínim {0} caràcters",
  "2018": "L'oficina tributària és obligatòria",
  "2019": "L'oficina tributària ha de tenir com a màxim {0} caràcters",
  "2020": "L'oficina tributària ha de tenir com a mínim {0} caràcters",
  "2021": "La raó social de l'empresa és obligatòria",
  "2022": "La raó social de l'empresa ha de tenir com a màxim {0} caràcters",
  "2023": "La raó social de l'empresa ha de tenir com a mínim {0} caràcters",
  "2024": "El número fiscal és obligatori",
  "2025": "El número fiscal ha de tenir com a màxim {0} caràcters",
  "2026": "El número fiscal ha de tenir com a mínim {0} caràcters",
  "2027": "L'oficina tributària {0} ha de contenir només caràcters alfabètics",
  "2028": "El nom ha de tenir com a màxim {0} caràcters",
  "2029": "El número de GSM ha de tenir com a màxim {0} caràcters",
  "2030": "L'IBAN enviat té un format no vàlid",
  "2031": "El nom del contacte ha de contenir {0} caràcters alfabètics",
  "2032": "El cognom del contacte ha de contenir {0} caràcters alfabètics",
  "2033": "La raó social ha de contenir {0} caràcters alfanumèrics",
  "2034": "El número de GSM no ha de contenir caràcters alfabètics",
  "2035": "El número fiscal ha de contenir només dígits",
  "2036": "El codi SWIFT és obligatori",
  "2037": "La moneda del compte bancari del subcomerciant ha de coincidir amb la moneda del compte local",
  "2038": "Els IBANs per a comptes en lires turques han de començar per TR",
  "2039": "El codi SWIFT ha de tenir com a màxim {0} caràcters",
  "2040": "Descripció de transferència no vàlida",
  "1401": "El número de targeta és obligatori",
  "3000": "externalId ha de tenir com a màxim {0} caràcters",
  "3001": "cardUserKey és obligatori",
  "3002": "cardToken és obligatori",
  "3003": "La informació de la targeta és obligatòria",
  "3004": "S'ha produït un error durant l'emmagatzematge de la targeta",
  "3005": "No s'ha trobat el cardUserKey",
  "3006": "No s'ha trobat el cardToken",
  "3007": "La funció d'emmagatzematge de targetes no està definida",
  "3008": "Error d'encriptació",
  "3009": "Error de desencriptació",
  "3010": "No s'ha trobat la targeta",
  "3011": "La clau d'usuari de la targeta no coincideix",
  "3012": "El correu electrònic no pot contenir el número de targeta",
  "3013": "externalId no pot contenir el número de targeta",
  "3014": "La informació de merchantId és obligatòria",
  "3015": "La informació de changeManagementId és obligatòria",
  "3016": "La informació de anonymizationType és obligatòria",
  "3017": "S'ha produït un error durant l'anonimització de la targeta",
  "3018": "La funció de llista negra per a emmagatzematge de targetes no està definida",
  "3019": "No s'ha trobat cap llista negra activa",
  "3020": "Ja existeix una llista negra activa",
  "3021": "S'ha produït un error durant l'actualització de l'usuari de la targeta",
  "3022": "La informació de toMerchantId és obligatòria",
  "4000": "subMerchantKey és obligatori",
  "4001": "El motiu és obligatori",
  "4002": "No s'ha trobat el subcomerciant",
  "4003": "No hi ha cap registre de saldo per a l'emissor",
  "4004": "Saldo insuficient per a l'emissor",
  "4005": "El comerciant no està autoritzat per utilitzar el servei de liquidació",
  "4006": "Per realitzar una liquidació, cal desactivar la configuració del subcomerciant per enviar fons al saldo",
  "10005": "S'ha produït un error durant el procés de pagament, si us plau, contacta amb el teu banc.",
  "10012": "S'ha produït un error durant el procés de pagament, si us plau, contacta amb el teu banc.",
  "10034": "L'operació no ha estat permesa pel banc.",
  "10041": "S'ha superat el límit d'intents de PIN, l'operació no és permesa pel banc.",
  "10043": "L'operació no és permesa pel banc.",
  "10051": "Límit de la targeta insuficient, saldo insuficient.",
  "10054": "Data de caducitat incorrecta. La teva targeta ha caducat.",
  "10057": "La teva targeta està restringida per a aquesta transacció, si us plau, contacta amb el teu banc.",
  "10058": "S'ha produït un error durant el pagament, si us plau, contacta amb el representant de l'empresa.",
  "10084": "El codi CVV introduït és incorrecte o no vàlid.",
  "10093": "La teva targeta està desactivada per a compres en línia, si us plau, contacta amb el teu banc.",
  "10201": "La targeta no ha permès la transacció, si us plau, contacta amb el teu banc.",
  "10202": "S'ha produït un error durant el procés de pagament, si us plau, contacta amb el representant de l'empresa.",
  "10204": "S'ha produït un error durant el procés de pagament, si us plau, contacta amb el representant de l'empresa.",
  "10205": "L'adreça de correu electrònic no té un format vàlid, si us plau, comprova-la.",
  "10207": "Si us plau, sol·licita l'aprovació del teu banc.",
  "10208": "S'ha produït un error durant el pagament, si us plau, contacta amb el representant de l'empresa.",
  "10209": "Targeta bloquejada, si us plau, contacta amb el teu banc.",
  "10210": "Informació del CVC incorrecta, intenta-ho de nou.",
  "10211": "S'ha produït un error durant el pagament, si us plau, contacta amb el teu banc.",
  "10212": "S'ha superat el nombre màxim d'intents incorrectes de CVC, si us plau, contacta amb el teu banc.",
  "10213": "BIN no trobat, si us plau, contacta amb el representant de l'empresa.",
  "10214": "S'ha produït un error al banc, intenta-ho més tard.",
  "10215": "Targeta no vàlida, número de targeta incorrecte, si us plau, comprova'l.",
  "10216": "S'ha produït un error al banc, intenta-ho més tard.",
  "10217": "La transacció s'ha de fer amb 3D Secure.",
  "10218": "No es permet el pagament a terminis amb targetes de dèbit, si us plau, intenta-ho de nou.",
  "10219": "S'ha produït un error al banc, intenta-ho més tard.",
  "10220": "Si us plau, torna-ho a intentar. Si l'error persisteix, contacta amb el teu banc.",
  "10221": "No es permeten transaccions amb targetes estrangeres, si us plau, contacta amb el representant de l'empresa.",
  "10222": "El TPV està tancat per a transaccions a terminis, si us plau, contacta amb el representant de l'empresa.",
  "10223": "Es requereix el tancament del dia per al TPV.",
  "10224": "S'ha superat el límit de transaccions de la teva targeta, si us plau, contacta amb el teu banc.",
  "10225": "La teva targeta està restringida per a aquesta transacció, si us plau, contacta amb el teu banc.",
  "10226": "Has superat el nombre permès d'intents de PIN, si us plau, contacta amb el teu banc.",
  "10227": "PIN incorrecte, si us plau, intenta-ho de nou.",
  "10228": "S'ha produït un error al banc, intenta-ho més tard.",
  "10229": "Data de caducitat de la targeta incorrecta, si us plau, intenta-ho de nou.",
  "10230": "La sol·licitud de pagament ha estat bloquejada pel banc, si us plau, contacta amb el teu banc.",
  "10231": "L'import de la venda no pot ser inferior als punts utilitzats.",
  "10232": "Import no vàlid, si us plau, contacta amb el teu banc.",
  "10233": "Tipus de targeta no vàlid, si us plau, contacta amb el teu banc.",
  "10234": "Punts insuficients.",
  "10235": "Error amb la targeta American Express, si us plau, contacta amb el teu banc.",
  "10237": "No es permet el reemborsament en transaccions amb targeta de dèbit.",
  "10238": "Transacció no vàlida.",
  "10239": "El pagament ha estat cancel·lat per l'usuari.",
  "10240": "La sol·licitud enviada ha superat el temps límit.",
  "10241": "Error de comunicació o del sistema.",
  "10242": "Error de comunicació o del sistema.",
  "10243": "El pagament no ha estat acceptat.",
  "10244": "El pagament no ha estat acceptat.",
  "10245": "L'import del reemborsament de la quota i el total reemborsat anteriorment no poden ser superiors a l'import de la quota.",
  "10246": "Actualment no pots fer un reemborsament per la transacció feta amb el mètode de pagament alternatiu, si us plau, intenta-ho més tard.",
  "10247": "Pagament per transferència bancària no realitzat.",
  "10248": "L'import que vols operar supera el límit de transacció, si us plau, contacta amb el teu banc.",
  "10249": "S'ha produït un error durant el pagament del saldo, si us plau, contacta amb el representant de l'empresa.",
  "10250": "No es poden utilitzar punts en transaccions a terminis.",
  "10251": "No es poden utilitzar punts i límit de targeta conjuntament amb la targeta utilitzada en la transacció."
}
