{
  "1": "เกิดข้อผิดพลาดของระบบ",
  "2": "เกิดข้อผิดพลาดของระบบ",
  "3": "จำเป็นต้องระบุอีเมล",
  "4": "อีเมลต้องมีความยาวไม่เกิน {0} ตัวอักษร",
  "5": "รูปแบบอีเมลไม่ถูกต้อง",
  "6": "จำเป็นต้องระบุอ็อบเจ็กต์คำขอ",
  "7": "รูปแบบวันที่ไม่ถูกต้องสำหรับ {0}",
  "8": "จำเป็นต้องระบุหมายเลขประจำตัว",
  "9": "หมายเลขประจำตัวต้องมีไม่เกิน {0} ตัวอักษร",
  "10": "หมายเลขประจำตัวต้องมีอย่างน้อย {0} ตัวอักษร",
  "11": "คำขอไม่ถูกต้อง",
  "12": "หมายเลขบัตรไม่ถูกต้อง",
  "13": "เดือนหมดอายุไม่ถูกต้อง",
  "14": "ปีหมดอายุไม่ถูกต้อง",
  "15": "CVC ไม่ถูกต้อง",
  "16": "จำเป็นต้องระบุชื่อผู้ถือบัตร",
  "17": "วันหมดอายุของบัตรไม่ถูกต้อง",
  "18": "หมายเลขประจำตัว {0} อยู่ในรูปแบบไม่ถูกต้อง",
  "19": "ชื่อผู้ถือบัตรต้องมีไม่เกิน {0} ตัวอักษร",
  "20": "ConversationId ต้องมีไม่เกิน {0} ตัวอักษร",
  "21": "ชื่อเล่นของบัตรต้องมีไม่เกิน {0} ตัวอักษร",
  "22": "IP ต้องมีไม่เกิน {0} ตัวอักษร",
  "23": "Callback URL จำเป็นต้องระบุ",
  "24": "{0} จำเป็นต้องระบุ",
  "25": "จำเป็นต้องระบุหมายเลข GSM",
  "26": "หมายเลข GSM ต้องมีไม่เกิน {0} ตัวอักษร",
  "27": "หมายเลขโทรศัพท์ไม่ถูกต้อง",
  "28": "รูปแบบข้อมูลเมตาไม่ถูกต้อง",
  "29": "จำเป็นต้องระบุโทเค็นการอ้างสิทธิ์",
  "30": "จำเป็นต้องระบุรหัสสมาชิก",
  "31": "ConversationId อาจมีโค้ดที่เป็นอันตราย",
  "1000": "ลายเซ็นไม่ถูกต้อง",
  "1001": "ไม่พบรายละเอียดของ API",
  "1002": "ไม่พบบัญชีร้านค้า",
  "1003": "ข้อผิดพลาดในการอนุญาต",
  "1004": "จำเป็นต้องระบุข้อความสุ่ม",
  "1005": "จำเป็นต้องระบุอ็อบเจ็กต์คำขอ",
  "1006": "จำเป็นต้องระบุ API key",
  "1007": "จำเป็นต้องระบุลายเซ็น",
  "1008": "ไม่พบคำนำหน้าสำหรับส่วนหัวการอนุญาต",
  "1009": "จำเป็นต้องระบุสตริงส่วนหัวการอนุญาต",
  "1010": "ไม่พบบัญชีร้านค้าสำหรับ gateway",
  "1011": "บัญชีร้านค้าที่ได้รับอนุญาตไม่ตรงกับหมายเลขร้านค้า",
  "1012": "ไม่พบแพลตฟอร์มที่ใช้งานอยู่",
  "1013": "ไม่พบบัญชีผู้ใช้ที่ตรงกับชื่อแอปพลิเคชัน",
  "1014": "ไม่พบข้อมูลความปลอดภัย",
  "1015": "จำเป็นต้องระบุชื่อแอปพลิเคชัน",
  "2000": "บริการนี้ให้เฉพาะลูกค้าที่ใช้ marketplace",
  "2001": "ไม่พบบัญชีร้านค้าย่อย",
  "2002": "ร้านค้าย่อยมีอยู่แล้ว",
  "2003": "subMerchantKey จำเป็นต้องระบุ",
  "2004": "subMerchantType จำเป็นต้องระบุ",
  "2005": "จำเป็นต้องระบุ IBAN",
  "2007": "subMerchantExternalId จำเป็นต้องระบุ",
  "2008": "subMerchantExternalId ต้องมีไม่เกิน {0} ตัวอักษร",
  "2009": "ที่อยู่จำเป็นต้องระบุ",
  "2010": "ที่อยู่ต้องมีไม่เกิน {0} ตัวอักษร",
  "2011": "ที่อยู่ต้องมีอย่างน้อย {0} ตัวอักษร",
  "2012": "จำเป็นต้องระบุชื่อผู้ติดต่อ",
  "2013": "ชื่อผู้ติดต่อต้องมีไม่เกิน {0} ตัวอักษร",
  "2014": "ชื่อผู้ติดต่อต้องมีอย่างน้อย {0} ตัวอักษร",
  "2015": "จำเป็นต้องระบุนามสกุลผู้ติดต่อ",
  "2016": "นามสกุลต้องมีไม่เกิน {0} ตัวอักษร",
  "2017": "นามสกุลต้องมีอย่างน้อย {0} ตัวอักษร",
  "2018": "จำเป็นต้องระบุสำนักงานสรรพากร",
  "2019": "ชื่อสำนักงานสรรพากรต้องมีไม่เกิน {0} ตัวอักษร",
  "2020": "ชื่อสำนักงานสรรพากรต้องมีอย่างน้อย {0} ตัวอักษร",
  "2021": "จำเป็นต้องระบุชื่อบริษัทตามกฎหมาย",
  "2022": "ชื่อบริษัทต้องมีไม่เกิน {0} ตัวอักษร",
  "2023": "ชื่อบริษัทต้องมีอย่างน้อย {0} ตัวอักษร",
  "2024": "จำเป็นต้องระบุหมายเลขประจำตัวผู้เสียภาษี",
  "2025": "หมายเลขผู้เสียภาษีต้องมีไม่เกิน {0} ตัวอักษร",
  "2026": "หมายเลขผู้เสียภาษีต้องมีอย่างน้อย {0} ตัวอักษร",
  "2027": "ชื่อสำนักงานสรรพากร {0} ต้องประกอบด้วยตัวอักษรเท่านั้น",
  "2028": "ชื่อต้องมีไม่เกิน {0} ตัวอักษร",
  "2029": "หมายเลข GSM ต้องมีไม่เกิน {0} ตัวอักษร",
  "2030": "IBAN ที่ส่งมาอยู่ในรูปแบบไม่ถูกต้อง",
  "2031": "ชื่อผู้ติดต่อจะต้องประกอบด้วยตัวอักษร {0} ตัว",
  "2032": "นามสกุลผู้ติดต่อจะต้องประกอบด้วยตัวอักษร {0} ตัว",
  "2033": "ชื่อบริษัทต้องประกอบด้วยอักขระตัวอักษรและตัวเลข {0} ตัว",
  "2034": "หมายเลข GSM ต้องไม่มีตัวอักษร",
  "2035": "หมายเลขผู้เสียภาษีต้องประกอบด้วยตัวเลขเท่านั้น",
  "2036": "SWIFT code จำเป็นต้องระบุ",
  "2037": "สกุลเงินบัญชีของร้านค้าย่อยต้องตรงกับบัญชีธนาคารในประเทศ",
  "2038": "IBAN ของบัญชีสกุลเงินลีราตุรกีต้องขึ้นต้นด้วย TR",
  "2039": "SWIFT code ต้องมีไม่เกิน {0} ตัวอักษร",
  "2040": "คำอธิบายการโอนเงินไม่ถูกต้อง",
  "1401": "จำเป็นต้องระบุหมายเลขบัตร",
  "3000": "externalId ต้องมีไม่เกิน {0} ตัวอักษร",
  "3001": "จำเป็นต้องมี cardUserKey",
  "3002": "จำเป็นต้องมี cardToken",
  "3003": "จำเป็นต้องมีข้อมูลบัตร",
  "3004": "เกิดข้อผิดพลาดระหว่างการจัดเก็บบัตร",
  "3005": "ไม่พบ cardUserKey",
  "3006": "ไม่พบ cardToken",
  "3007": "ยังไม่ได้กำหนดฟีเจอร์การจัดเก็บบัตร",
  "3008": "ข้อผิดพลาดในการเข้ารหัส",
  "3009": "ข้อผิดพลาดในการถอดรหัส",
  "3010": "ไม่พบบัตร",
  "3011": "คีย์ของผู้ใช้บัตรไม่ตรงกัน",
  "3012": "อีเมลไม่สามารถมีหมายเลขบัตรได้",
  "3013": "externalId ไม่สามารถมีหมายเลขบัตรได้",
  "3014": "จำเป็นต้องมีข้อมูล merchantId",
  "3015": "จำเป็นต้องมีข้อมูล changeManagementId",
  "3016": "จำเป็นต้องมีข้อมูล anonymizationType",
  "3017": "เกิดข้อผิดพลาดระหว่างการทำให้ข้อมูลบัตรเป็นนิรนาม",
  "3018": "ยังไม่ได้กำหนดฟีเจอร์ blacklist สำหรับการจัดเก็บบัตร",
  "3019": "ไม่พบ blacklist ที่ใช้งานอยู่",
  "3020": "มี blacklist ที่ใช้งานอยู่แล้ว",
  "3021": "เกิดข้อผิดพลาดระหว่างการอัปเดตผู้ใช้บัตร",
  "3022": "จำเป็นต้องมีข้อมูล toMerchantId",
  "4000": "จำเป็นต้องมี subMerchantKey",
  "4001": "จำเป็นต้องมีเหตุผล",
  "4002": "ไม่พบผู้ค้ารอง",
  "4003": "ไม่มีข้อมูลยอดคงเหลือของผู้ส่ง",
  "4004": "ยอดคงเหลือของผู้ส่งไม่เพียงพอ",
  "4005": "ผู้ค้าไม่มีสิทธิ์ใช้บริการการชำระบัญชี",
  "4006": "เพื่อดำเนินการชำระบัญชี ผู้ค้ารองต้องปิดการตั้งค่าการโอนเงินไปยังยอดคงเหลือ",
  "10005": "ธุรกรรมไม่ได้รับการอนุมัติ",
  "10012": "ธุรกรรมไม่ถูกต้อง",
  "10034": "การชำระเงินไม่ผ่านการตรวจสอบความปลอดภัย",
  "10041": "บัตรหาย โปรดยึดบัตร",
  "10043": "บัตรหาย โปรดยึดบัตร",
  "10051": "วงเงินบัตรหรือยอดเงินไม่เพียงพอ",
  "10054": "วันหมดอายุไม่ถูกต้อง",
  "10057": "เจ้าของบัตรไม่สามารถดำเนินธุรกรรมนี้ได้",
  "10058": "เครื่องไม่ได้รับอนุญาตสำหรับธุรกรรมนี้",
  "10084": "ข้อมูล CVC2 ไม่ถูกต้อง",
  "10093": "บัตรของคุณถูกปิดใช้งานสำหรับการซื้อออนไลน์ กรุณาติดต่อธนาคารของคุณ",
  "10201": "บัตรไม่อนุญาตให้ทำธุรกรรม",
  "10202": "เกิดข้อผิดพลาดทั่วไประหว่างกระบวนการชำระเงิน",
  "10204": "เกิดข้อผิดพลาดทั่วไประหว่างกระบวนการชำระเงิน",
  "10205": "รูปแบบอีเมลไม่ถูกต้อง",
  "10207": "โปรดขออนุมัติจากธนาคารของคุณ",
  "10208": "รหัสหมวดหมู่ร้านค้าไม่ถูกต้อง",
  "10209": "บัตรถูกบล็อก",
  "10210": "ข้อมูล CAVV ไม่ถูกต้อง",
  "10211": "ข้อมูล ECI ไม่ถูกต้อง",
  "10212": "พยายามป้อน CVC2 เกินจำนวนที่อนุญาต",
  "10213": "ไม่พบ BIN",
  "10214": "ข้อผิดพลาดในการสื่อสารหรือระบบ",
  "10215": "หมายเลขบัตรไม่ถูกต้อง",
  "10216": "ไม่พบธนาคารผู้ออกบัตร",
  "10217": "บัตรเดบิตสามารถใช้ได้เฉพาะกับธุรกรรม 3D Secure เท่านั้น",
  "10218": "ไม่สามารถใช้บัตรเดบิตในการผ่อนชำระได้",
  "10219": "การร้องขอไปยังธนาคารหมดเวลา",
  "10220": "ไม่รับการชำระเงิน",
  "10221": "เครื่องไม่รองรับบัตรต่างประเทศ",
  "10222": "เครื่องไม่รองรับธุรกรรมผ่อนชำระ",
  "10223": "ต้องปิดยอดประจำวัน",
  "10224": "เกินวงเงินการถอนเงิน",
  "10225": "บัตรถูกจำกัด",
  "10226": "ป้อนรหัส PIN เกินจำนวนครั้งที่อนุญาต",
  "10227": "PIN ไม่ถูกต้อง",
  "10228": "ธนาคารหรือเครื่องไม่สามารถประมวลผลธุรกรรมได้",
  "10229": "วันหมดอายุไม่ถูกต้อง",
  "10230": "ธนาคารบล็อกคำขอ",
  "10231": "ยอดขายต้องไม่น้อยกว่าจำนวนคะแนนสะสม",
  "10232": "จำนวนเงินไม่ถูกต้อง",
  "10233": "ประเภทบัตรไม่ถูกต้อง",
  "10234": "คะแนนสะสมไม่เพียงพอ",
  "10235": "ข้อผิดพลาดของบัตร American Express",
  "10237": "ไม่อนุญาตให้คืนเงินสำหรับธุรกรรมบัตรเดบิต",
  "10238": "ธุรกรรมไม่ถูกต้อง",
  "10239": "ผู้ใช้ยกเลิกการชำระเงิน",
  "10240": "คำขอหมดเวลา",
  "10241": "ข้อผิดพลาดในการสื่อสารหรือระบบ",
  "10242": "ข้อผิดพลาดในการสื่อสารหรือระบบ",
  "10243": "ไม่รับการชำระเงิน",
  "10244": "ไม่รับการชำระเงิน",
  "10245": "ยอดคืนเงินและยอดคืนสะสมต้องไม่เกินยอดผ่อนชำระ",
  "10246": "ไม่สามารถดำเนินการคืนเงินสำหรับวิธีการชำระเงินทางเลือกนี้ได้ในขณะนี้ กรุณาลองใหม่ภายหลัง",
  "10247": "ยังไม่ได้ชำระเงินด้วยการโอนเงินผ่านธนาคาร",
  "10248": "จำนวนเงินเกินขีดจำกัด ไม่สามารถดำเนินการได้ขณะนี้",
  "10249": "เกิดข้อผิดพลาดระหว่างการชำระเงินผ่าน fund API",
  "10250": "ไม่สามารถใช้คะแนนกับธุรกรรมผ่อนชำระได้",
  "10251": "ไม่สามารถใช้คะแนนและวงเงินบัตรพร้อมกันกับบัตรนี้ได้"
}
